app/controllers/notes_controller.rb

    def index
        @result = Note.all.order("ID ASC")
---
SELECT "notes".* FROM "notes" ORDER BY ID DESC

    def show
        begin
            @id = params[:id]
            @result = Note.find(@id)
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def create
        #ajout de la note dans la bd
        @note = Note.new(note_params)
        @note.user = User.last
        if @note.save
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "notes" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "qsdfs"], ["content", "qsdfsqd"], ["created_at", "2017-07-06 14:59:02.752607"], ["updated_at", "2017-07-06 14:59:02.752607"], ["user_id", 1]]